:PROPERTIES:
:ID:       9233A39C-E359-4E85-8F0B-466D5B6481A6
:header-args: :results output :session gh :async
:END:
#+title: github

GitHub is a widely used [[file:git.org][git]] hosting site with social elements
(probably doesn't need an explanation).

I personally tend to gravitate towards alternatives, but GitHub is
widely used and also what I'm currently using professionally.

GitHub specific functionality can be accessed using the ~gh~ CLI tool.

* Installation

#+begin_src shell
  gh --version
#+end_src

#+RESULTS:
: gh version 2.93.0 (2026-05-27)
: https://github.com/cli/cli/releases/tag/v2.93.0

* Help

#+begin_src shell
  gh --help
#+end_src

#+RESULTS:
#+begin_example
Work seamlessly with GitHub from the command line.

USAGE
  gh <command> <subcommand> [flags]

CORE COMMANDS
  auth:          Authenticate gh and git with GitHub
  browse:        Open repositories, issues, pull requests, and more in the browser
  codespace:     Connect to and manage codespaces
  gist:          Manage gists
  issue:         Manage issues
  org:           Manage organizations
  pr:            Manage pull requests
  project:       Work with GitHub Projects.
  release:       Manage releases
  repo:          Manage repositories
  skill:         Install and manage agent skills (preview)

GITHUB ACTIONS COMMANDS
  cache:         Manage GitHub Actions caches
  run:           View details about workflow runs
  workflow:      View details about GitHub Actions workflows

ALIAS COMMANDS
  co:            Alias for "pr checkout"

ADDITIONAL COMMANDS
  agent-task:    Work with agent tasks (preview)
  alias:         Create command shortcuts
  api:           Make an authenticated GitHub API request
  attestation:   Work with artifact attestations
  completion:    Generate shell completion scripts
  config:        Manage configuration for gh
  copilot:       Run the GitHub Copilot CLI (preview)
  extension:     Manage gh extensions
  gpg-key:       Manage GPG keys
  label:         Manage labels
  licenses:      View third-party license information
  preview:       Execute previews for gh features
  ruleset:       View info about repo rulesets
  search:        Search for repositories, issues, and pull requests
  secret:        Manage GitHub secrets
  ssh-key:       Manage SSH keys
  status:        Print information about relevant issues, pull requests, and notifications across repositories
  variable:      Manage GitHub Actions variables

HELP TOPICS
  accessibility: Learn about GitHub CLI's accessibility experiences
  actions:       Learn about working with GitHub Actions
  environment:   Environment variables that can be used with gh
  exit-codes:    Exit codes used by gh
  formatting:    Formatting options for JSON data exported from gh
  mintty:        Information about using gh with MinTTY
  reference:     A comprehensive reference of all gh commands
  telemetry:     Information about telemetry in gh

FLAGS
  --help      Show help for command
  --version   Show gh version

EXAMPLES
  $ gh issue create
  $ gh repo clone cli/cli
  $ gh pr checkout 321

LEARN MORE
  Use `gh <command> <subcommand> --help` for more information about a command.
  Read the manual at https://cli.github.com/manual
  Learn about exit codes using `gh help exit-codes`
  Learn about accessibility experiences using `gh help accessibility`

#+end_example

* Repository Selection

The tool will use the repository for the current project if detected,
therefore a simple setup is to expect to invoke it within a project
working directory.

For notebook use, this will involve having a project-local notebook.

* auth

** Help

#+begin_src shell
  gh auth --help
#+end_src

#+RESULTS:
#+begin_example
gh auth --help
Authenticate gh and git with GitHub

USAGE
  gh auth <command> [flags]

AVAILABLE COMMANDS
  login:         Log in to a GitHub account
  logout:        Log out of a GitHub account
  refresh:       Refresh stored authentication credentials
  setup-git:     Setup git with GitHub CLI
  status:        Display active account and authentication state on each known GitHub host
  switch:        Switch active GitHub account
  token:         Print the authentication token gh uses for a hostname and account

INHERITED FLAGS
  --help   Show help for command

LEARN MORE
  Use `gh <command> <subcommand> --help` for more information about a command.
  Read the manual at https://cli.github.com/manual
  Learn about exit codes using `gh help exit-codes`
  Learn about accessibility experiences using `gh help accessibility`
[?2004hecho 'ob_comint_async_shell_end_798b160f-b4c2-498c-a19f-d272d1d9ec7d'[?2004l
#+end_example

** Login

#+begin_src shell
  gh auth login --help
#+end_src

#+RESULTS:
#+begin_example
gh auth login --help
Authenticate with a GitHub host.

The default hostname is `github.com`. This can be overridden using the `--hostname`
flag.

The default authentication mode is a web-based browser flow. After completion, an
authentication token will be stored securely in the system credential store.
If a credential store is not found or there is an issue using it gh will fallback
to writing the token to a plain text file. See `gh auth status` for its
stored location.

Alternatively, use `--with-token` to pass in a personal access token (classic) on standard input.
The minimum required scopes for the token are: `repo`, `read:org`, and `gist`.
Take care when passing a fine-grained personal access token to `--with-token`
as the inherent scoping to certain resources may cause confusing behaviour when interacting with other
resources. Favour setting `GH_TOKEN` for fine-grained personal access token usage.

Alternatively, gh will use the authentication token found in environment variables.
This method is most suitable for "headless" use of gh such as in automation. See
`gh help environment` for more info.

To use gh in GitHub Actions, add `GH_TOKEN: ${{ github.token }}` to `env`.

The git protocol to use for git operations on this host can be set with `--git-protocol`,
or during the interactive prompting. Although login is for a single account on a host, setting
the git protocol will take effect for all users on the host.

Specifying `ssh` for the git protocol will detect existing SSH keys to upload,
prompting to create and upload a new key if one is not found. This can be skipped with
`--skip-ssh-key` flag.

For more information on OAuth scopes, see
<https://docs.github.com/en/developers/apps/building-oauth-apps/scopes-for-oauth-apps/>.


USAGE
  gh auth login [flags]

FLAGS
  -c, --clipboard             Copy one-time OAuth device code to clipboard
  -p, --git-protocol string   The protocol to use for git operations on this host: {ssh|https}
  -h, --hostname string       The hostname of the GitHub instance to authenticate with
      --insecure-storage      Save authentication credentials in plain text instead of credential store
  -s, --scopes strings        Additional authentication scopes to request
      --skip-ssh-key          Skip generate/upload SSH key prompt
  -w, --web                   Open a browser to authenticate
      --with-token            Read token from standard input

INHERITED FLAGS
  --help   Show help for command

EXAMPLES
  # Start interactive setup
  $ gh auth login
  
  # Open a browser to authenticate and copy one-time OAuth code to clipboard
  $ gh auth login --web --clipboard
  
  # Authenticate against github.com by reading the token from a file
  $ gh auth login --with-token < mytoken.txt
  
  # Authenticate with specific host
  $ gh auth login --hostname enterprise.internal

LEARN MORE
  Use `gh <command> <subcommand> --help` for more information about a command.
  Read the manual at https://cli.github.com/manual
  Learn about exit codes using `gh help exit-codes`
  Learn about accessibility experiences using `gh help accessibility`
[?2004hecho 'ob_comint_async_shell_end_45928b8b-4fa0-42a6-931d-10a20d158c0d'[?2004l
#+end_example

** Auth From Environment

A Personal Access Token can be created in the UI: https://github.com/settings/tokens
And if it is loaded as the ~GH_TOKEN~ environment variable it will be used.
It looks the ~read:org~ scope is often required.
(the scopes should have their documentation captured somewhere in here).


** Status

*** Help

#+begin_src shell
  gh auth status --help
#+end_src

#+RESULTS:
#+begin_example
gh auth status --help
Display active account and authentication state on each known GitHub host.

For each host, the authentication state of each known account is tested and any issues are included in the output.
Each host section will indicate the active account, which will be used when targeting that host.

If an account on any host (or only the one given via `--hostname`) has authentication issues,
the command will exit with 1 and output to stderr. Note that when using the `--json` option, the command
will always exit with zero regardless of any authentication issues, unless there is a fatal error.

To change the active account for a host, see `gh auth switch`.

For more information about output formatting flags, see `gh help formatting`.

USAGE
  gh auth status [flags]

FLAGS
  -a, --active            Display the active account only
  -h, --hostname string   Check only a specific hostname's auth status
      --jq expression     Filter JSON output using a jq expression
      --json fields       Output JSON with the specified fields
  -t, --show-token        Display the auth token
      --template string   Format JSON output using a Go template; see "gh help formatting"

INHERITED FLAGS
  --help   Show help for command

JSON FIELDS
  hosts

EXAMPLES
  # Display authentication status for all accounts on all hosts
  $ gh auth status
  
  # Display authentication status for the active account on a specific host
  $ gh auth status --active --hostname github.example.com
  
  # Display tokens in plain text
  $ gh auth status --show-token
  
  # Format authentication status as JSON
  $ gh auth status --json hosts
  
  # Include plain text token in JSON output
  $ gh auth status --json hosts --show-token
  
  # Format hosts as a flat JSON array
  $ gh auth status --json hosts --jq '.hosts | add'

LEARN MORE
  Use `gh <command> <subcommand> --help` for more information about a command.
  Read the manual at https://cli.github.com/manual
  Learn about exit codes using `gh help exit-codes`
  Learn about accessibility experiences using `gh help accessibility`
[?2004hecho 'ob_comint_async_shell_end_723045f7-49ed-403b-a353-329439fe6b24'[?2004l
#+end_example

** Sample

#+begin_src shell
  gh auth status
#+end_src

#+RESULTS:
: gh auth status
: github.com
:   ✓ Logged in to github.com account mwhipple (GH_TOKEN)
:   - Active account: true
:   - Git operations protocol: https
:   - Token: ghp_************************************
:   - Token scopes: 'read:org', 'repo'
: [?2004hecho 'ob_comint_async_shell_end_c533e9d5-4b87-4c8b-95d1-ef68d78dfb27'[?2004l

* Issues

** Help

#+begin_src shell
  gh issue --help
#+end_src

#+RESULTS:
#+begin_example
Work with GitHub issues.

USAGE
  gh issue <command> [flags]

GENERAL COMMANDS
  create:        Create a new issue
  list:          List issues in a repository
  status:        Show status of relevant issues

TARGETED COMMANDS
  close:         Close issue
  comment:       Add a comment to an issue
  delete:        Delete issue
  develop:       Manage linked branches for an issue
  edit:          Edit issues
  lock:          Lock issue conversation
  pin:           Pin an issue
  reopen:        Reopen issue
  transfer:      Transfer issue to another repository
  unlock:        Unlock issue conversation
  unpin:         Unpin an issue
  view:          View an issue

FLAGS
  -R, --repo [HOST/]OWNER/REPO   Select another repository using the [HOST/]OWNER/REPO format

INHERITED FLAGS
  --help   Show help for command

ARGUMENTS
  An issue can be supplied as argument in any of the following formats:
  - by number, e.g. "123"; or
  - by URL, e.g. "https://github.com/OWNER/REPO/issues/123".

EXAMPLES
  $ gh issue list
  $ gh issue create --label bug
  $ gh issue view 123 --web

LEARN MORE
  Use `gh <command> <subcommand> --help` for more information about a command.
  Read the manual at https://cli.github.com/manual
  Learn about exit codes using `gh help exit-codes`
  Learn about accessibility experiences using `gh help accessibility`

#+end_example

** List

*** Help

#+begin_src shell
  gh issue list --help
#+end_src

#+RESULTS:
#+begin_example
gh issue list --help
List issues in a GitHub repository. By default, this only lists open issues.

The search query syntax is documented here:
<https://docs.github.com/en/search-github/searching-on-github/searching-issues-and-pull-requests>

On supported GitHub hosts, advanced issue search syntax can be used in the
`--search` query. For more information about advanced issue search, see:
<https://docs.github.com/en/issues/tracking-your-work-with-issues/using-issues/filtering-and-searching-issues-and-pull-requests#building-advanced-filters-for-issues>

For more information about output formatting flags, see `gh help formatting`.

USAGE
  gh issue list [flags]

ALIASES
  gh issue ls

FLAGS
      --app string         Filter by GitHub App author
  -a, --assignee string    Filter by assignee
  -A, --author string      Filter by author
  -q, --jq expression      Filter JSON output using a jq expression
      --json fields        Output JSON with the specified fields
  -l, --label strings      Filter by label
  -L, --limit int          Maximum number of issues to fetch (default 30)
      --mention string     Filter by mention
  -m, --milestone string   Filter by milestone number or title
  -S, --search query       Search issues with query
  -s, --state string       Filter by state: {open|closed|all} (default "open")
  -t, --template string    Format JSON output using a Go template; see "gh help formatting"
  -w, --web                List issues in the web browser

INHERITED FLAGS
      --help                     Show help for command
  -R, --repo [HOST/]OWNER/REPO   Select another repository using the [HOST/]OWNER/REPO format

JSON FIELDS
  assignees, author, body, closed, closedAt, closedByPullRequestsReferences,
  comments, createdAt, id, isPinned, labels, milestone, number, projectCards,
  projectItems, reactionGroups, state, stateReason, title, updatedAt, url

EXAMPLES
  $ gh issue list --label "bug" --label "help wanted"
  $ gh issue list --author monalisa
  $ gh issue list --assignee "@me"
  $ gh issue list --milestone "The big 1.0"
  $ gh issue list --search "error no:assignee sort:created-asc"
  $ gh issue list --state all

LEARN MORE
  Use `gh <command> <subcommand> --help` for more information about a command.
  Read the manual at https://cli.github.com/manual
  Learn about exit codes using `gh help exit-codes`
  Learn about accessibility experiences using `gh help accessibility`
[?2004hecho 'ob_comint_async_shell_end_a1a7ff1b-191a-4e77-b3b3-531e5ba16692'[?2004l
#+end_example

*** Use

#+begin_src shell
  gh issue list
#+end_src

#+RESULTS:
: gh issue list
: no open issues in mwhipple/cabinet
: [?2004hecho 'ob_comint_async_shell_end_5cb68756-7cb0-4e41-abe1-32b7ad38235d'[?2004l
